src/erlang/concurrency/otp.org
#+TITLE: OTP库
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/main.css" />
#+HTML_LINK_UP: distributed_programming.html   
#+HTML_LINK_HOME: concurrency.html
#+OPTIONS: num:nil timestamp:nil ^:nil 


OTP代表 _Open Telecom Platform_ (开放电信平台)。这个名字其实有一些误导性,因为OTP比你想象的要通用得多。它是一个 *应用程序操作系统* ,包含了一组 _库_ 和 _实现_ 方式,可以构建 _大规模_ 、 _容错_ 和 _分布式_ 的应用程序

#+BEGIN_EXAMPLE
  它由瑞典电信公司爱立信开发,在爱立信内部用于构建容错式系统

  标准的Erlang分发套装包含OTP库
#+END_EXAMPLE

OTP包含了许多强大的工具,例如一个完整的Web服务器,一个FTP服务器和一个 CORBA ORB 等,它们全都是用Erlang编写的

#+BEGIN_EXAMPLE
  OTP还包含了构建电信应用程序的最先进工具,能够实现 H248、SNMP和ASN.1/Erlang交叉编译器(这些是电信行业里常用的协议)

  不会在这里讨论它们,你可以在Erlang网站 上找到和这些主题相关的大量信息
#+END_EXAMPLE

如果想用OTP编写自己的应用程序,你会发现一个很有用的核心概念是 _OTP行为_ 。 行为封装了常见的行为模式,可以把它看作是一个用 *回调函数* 作为 _参数_ 的 *应用程序框架* 。OTP的优势来自于 *行为本身就能提供 _容错性_ 、 _可扩展性_ 和 _动态代码升级_ 等* 属性

#+BEGIN_EXAMPLE
  换句话说，回调函数的编写者不必担心容错之类的事情,因为行为已经提供了它们

  熟悉Java的读者可以把行为看作是一个J2EE容器
#+END_EXAMPLE

简单地说,行为负责解决问题的非业务部分,而回调函数负责解决业务部分

#+BEGIN_EXAMPLE
  问题的非业务部分(比如如何进行实时代码升级)对所有应用程序都是一样的，而业务部分(由回调函数提供)在每个问题里都是不同的
#+END_EXAMPLE

接下来将非常详细地介绍其中一种行为: _gen_server_ 模块。但是,在深入gen_server 工作方式的核心细节之前：
1. 从一个简单的服务器(能想象的最简单的服务器)入手
2. 一步步改进它，直到实现 gen_server 模块的完整功能
3. 能切实理解 gen_server 是如何工作的,并为深入探索做好准备
* 通用服务器之路
  #+BEGIN_EXAMPLE
    这是里最重要的一节,所以请读一遍,再读两遍,甚至读一百遍,确保能完全理解里面的内容
  #+END_EXAMPLE

  这一节是关于 *构建抽象* 的,将看到一个名为 _gen_server.erl_ 的服务器

  #+BEGIN_EXAMPLE
    gen server(通用服务器)是OTP系统里最常用的抽象,但很多人从来没有深入探寻过 gen_server.erl 是如何工作的

    一旦理解了gen server是如何构建的,就能重复这个抽象过程来构建自己的抽象
  #+END_EXAMPLE

  接下来将编写四个小小的服务器: server1 、 server2 、 server3 和 server4 ,每一个服务器都与上一个稍有不同。 server4 会类似于Erlang分发套装里的gen server

  #+BEGIN_EXAMPLE
    我们的目标是把问题的非业务部分与业务部分完全分开

    这句话现在也许对你没有什么意义,但是请别担心,很快就会有了。深呼吸!
  #+END_EXAMPLE
** 基本的服务器
   以下代码是我们的首次尝试。它是一个小小的服务器,可以用 *回调模块* 作为它的 _参数_ 

   #+BEGIN_SRC erlang 
  -module(server1).
  -export([start/2, rpc/2]).


  start(ServerProcessName, Mod) ->
      register(ServerProcessName, spawn(fun() -> loop(ServerProcessName, Mod, Mod:init()) end)).

  rpc(ServerProcessName, Request) ->
      ServerProcessName ! {self(), Request},
      receive
	  {ServerProcessName, Response} -> Response
      end.

  loop(ServerProcessName, Mod, State) ->
      receive
	  {FromProcess, Request} ->
	      {Response, State1} = Mod:handle(Request, State),
	      FromProcess ! {ServerProcessName, Response},
	      loop(ServerProcessName, Mod, State1)
      end.
   #+END_SRC

   这一小段代码凝聚了服务器的精华。下面给 server1 编写一个回调模块,它是一个 _名称服务器_ 回调模块:

   #+BEGIN_SRC erlang 
  -module(name_server).
  -export([init/0, add/2, find/1, handle/2]).
  -import(server1, [rpc/2]).

  %% client routines
  add(Key, Value) -> rpc(name_server, {add, Key, Value}).
  find(Key)       -> rpc(name_server, {find, Key}).

  %% callback routines
  init() -> dict:new().
  handle({add, Key, Value}, Dict) -> {ok, dict:store(Key, Value, Dict)};
  handle({find, Key}, Dict)       -> {dict:find(Key, Dict), Dict}.
   #+END_SRC

   这段代码实际上执行两个任务：
   + 首先充当被 _服务器框架代码_ *调用* 的 _回调模块_ ： init 和 handle 函数
   + 它还包含了将被 _客户端_ *调用* 的 _接口方法_ ： add 和 find 函数

   #+BEGIN_EXAMPLE
     OTP的惯例是把这两类函数放在同一个模块里
   #+END_EXAMPLE

   为了证明它能工作,可以这么做:

   #+BEGIN_SRC sh 
  5> server1:start(name_server, name_server) .  
  true

  7> name_server:add(joe, "at_home") .  
  ok
  
  8> name_server:find(joe) .             
  {ok,"at_home"}
   #+END_SRC

   #+BEGIN_EXAMPLE
     现在停下来想一想。这个回调模块没有用于并发的代码,没有创建进程,没有发送消息,没有接收消息,也没有注册进程

     它是纯粹的顺序代码,别无其他。这就意味着我们可以在完全不了解底层并发模型的情况下编写客户端，服务器模型

     这就是所有服务器的基本模式，一旦理解了基本的结构,就可以轻轻松松地“自主研发”了
   #+END_EXAMPLE
