html/erlang/concurrency/otp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OTP库</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="distributed_programming.html"> UP </a>
 |
 <a accesskey="H" href="concurrency.html"> HOME </a>
</div><div id="content">
<h1 class="title">OTP库</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org40db942">通用服务器之路</a>
<ul>
<li><a href="#orgbb5c300">基本的服务器</a></li>
<li><a href="#org9d5c35c">实现事务</a></li>
<li><a href="#org138ec7a">热代码交换</a></li>
<li><a href="#org79adf5a">事务与热代码交换</a></li>
<li><a href="#orge89402d">更多乐趣</a>
<ul>
<li><a href="#orge0ee7cd">思考</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4fc5bbf">gen_server 入门</a>
<ul>
<li><a href="#orgbdad234">确定回调模块名</a></li>
<li><a href="#org877603b">编写接口方法</a></li>
<li><a href="#org5b34c42">编写回调方法</a></li>
<li><a href="#orgc5d234b">测试</a></li>
</ul>
</li>
<li><a href="#orgb83d8bb">gen_server 的回调结构</a>
<ul>
<li><a href="#org357bf5e">启动服务器</a></li>
<li><a href="#org32db777">调用服务器</a>
<ul>
<li><a href="#org720dbfc">播发</a></li>
<li><a href="#orgfdddab7">发给服务器的自发性消息</a></li>
</ul>
</li>
<li><a href="#orgff84f4d">终止</a></li>
<li><a href="#org40deb59">代码更改</a></li>
</ul>
</li>
<li><a href="#org282cc56">填写 gen_server 模板</a></li>
<li><a href="#orge99efcc">OTP 总结</a></li>
</ul>
</div>
</div>
<p>
OTP代表 <span class="underline">Open Telecom Platform</span> (开放电信平台)。这个名字其实有一些误导性,因为OTP比你想象的要通用得多。它是一个 <b>应用程序操作系统</b> ,包含了一组 <span class="underline">库</span> 和 <span class="underline">实现</span> 方式,可以构建 <span class="underline">大规模</span> 、 <span class="underline">容错</span> 和 <span class="underline">分布式</span> 的应用程序
</p>

<pre class="example">
  它由瑞典电信公司爱立信开发,在爱立信内部用于构建容错式系统

  标准的Erlang分发套装包含OTP库
</pre>

<p>
OTP包含了许多强大的工具,例如一个完整的Web服务器,一个FTP服务器和一个 CORBA ORB 等,它们全都是用Erlang编写的
</p>

<pre class="example">
OTP还包含了构建电信应用程序的最先进工具,能够实现 H248、SNMP和ASN.1/Erlang交叉编译器(这些是电信行业里常用的协议)

不会在这里讨论它们,你可以在Erlang网站 上找到和这些主题相关的大量信息
</pre>

<p>
如果想用OTP编写自己的应用程序,你会发现一个很有用的核心概念是 <span class="underline">OTP行为</span> 。 行为封装了常见的行为模式,可以把它看作是一个用 <b>回调函数</b> 作为 <span class="underline">参数</span> 的 <b>应用程序框架</b> 。OTP的优势来自于 <b>行为本身就能提供 <span class="underline">容错性</span> 、 <span class="underline">可扩展性</span> 和 <span class="underline">动态代码升级</span> 等</b> 属性
</p>

<pre class="example">
  换句话说，回调函数的编写者不必担心容错之类的事情,因为行为已经提供了它们

  熟悉Java的读者可以把行为看作是一个J2EE容器
</pre>

<p>
简单地说,行为负责解决问题的非业务部分,而回调函数负责解决业务部分
</p>

<pre class="example">
  问题的非业务部分(比如如何进行实时代码升级)对所有应用程序都是一样的，而业务部分(由回调函数提供)在每个问题里都是不同的
</pre>

<p>
接下来将非常详细地介绍其中一种行为: <span class="underline">gen_server</span> 模块。但是,在深入gen_server 工作方式的核心细节之前：
</p>
<ol class="org-ol">
<li>从一个简单的服务器(能想象的最简单的服务器)入手</li>
<li>一步步改进它，直到实现 gen_server 模块的完整功能</li>
<li>能切实理解 gen_server 是如何工作的,并为深入探索做好准备</li>
</ol>
<div id="outline-container-org40db942" class="outline-2">
<h2 id="org40db942">通用服务器之路</h2>
<div class="outline-text-2" id="text-org40db942">
<pre class="example">
    这是里最重要的一节,所以请读一遍,再读两遍,甚至读一百遍,确保能完全理解里面的内容
</pre>

<p>
这一节是关于 <b>构建抽象</b> 的,将看到一个名为 <span class="underline">gen_server.erl</span> 的服务器
</p>

<pre class="example">
gen server(通用服务器)是OTP系统里最常用的抽象,但很多人从来没有深入探寻过 gen_server.erl 是如何工作的

一旦理解了gen server是如何构建的,就能重复这个抽象过程来构建自己的抽象
</pre>

<p>
接下来将编写四个小小的服务器: server1 、 server2 、 server3 和 server4 ,每一个服务器都与上一个稍有不同。 server4 会类似于Erlang分发套装里的gen server
</p>

<pre class="example">
    我们的目标是把问题的非业务部分与业务部分完全分开

    这句话现在也许对你没有什么意义,但是请别担心,很快就会有了。深呼吸!
</pre>
</div>
<div id="outline-container-orgbb5c300" class="outline-3">
<h3 id="orgbb5c300">基本的服务器</h3>
<div class="outline-text-3" id="text-orgbb5c300">
<p>
以下代码是我们的首次尝试。它是一个小小的服务器,可以用 <b>回调模块</b> 作为它的 <span class="underline">参数</span> 
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #7fffd4;">-module</span>(server1).
<span style="color: #7fffd4;">-export</span>([<span style="color: #98fb98;">start/2</span>, <span style="color: #98fb98;">rpc/2</span>]).


<span style="color: #87cefa;">start</span>(<span style="color: #eedd82;">ServerProcessName</span>, <span style="color: #eedd82;">Mod</span>) -&gt;
    <span style="color: #b0c4de;">register</span>(<span style="color: #eedd82;">ServerProcessName</span>, <span style="color: #b0c4de;">spawn</span>(<span style="color: #00ffff;">fun</span>() -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">loop</span>(<span style="color: #eedd82;">ServerProcessName</span>, <span style="color: #eedd82;">Mod</span>, <span style="color: #eedd82;">Mod</span>:<span style="color: #98fb98;">init</span>()) <span style="color: #00ffff;">end</span>)).

<span style="color: #87cefa;">rpc</span>(<span style="color: #eedd82;">ServerProcessName</span>, <span style="color: #eedd82;">Request</span>) -&gt;
    <span style="color: #eedd82;">ServerProcessName</span> ! {<span style="color: #b0c4de;">self</span>(), <span style="color: #eedd82;">Request</span>},
    <span style="color: #00ffff;">receive</span>
        {<span style="color: #eedd82;">ServerProcessName</span>, <span style="color: #eedd82;">Response</span>} -&gt;<span style="color: #87cefa;"> </span><span style="color: #eedd82;">Response</span>
    <span style="color: #00ffff;">end</span>.

<span style="color: #87cefa;">loop</span>(<span style="color: #eedd82;">ServerProcessName</span>, <span style="color: #eedd82;">Mod</span>, <span style="color: #eedd82;">State</span>) -&gt;
    <span style="color: #00ffff;">receive</span>
        {<span style="color: #eedd82;">FromProcess</span>, <span style="color: #eedd82;">Request</span>} -&gt;
            {<span style="color: #eedd82;">Response</span>, <span style="color: #eedd82;">State1</span>} = <span style="color: #eedd82;">Mod</span>:<span style="color: #98fb98;">handle</span>(<span style="color: #eedd82;">Request</span>, <span style="color: #eedd82;">State</span>),
            <span style="color: #eedd82;">FromProcess</span> ! {<span style="color: #eedd82;">ServerProcessName</span>, <span style="color: #eedd82;">Response</span>},
            <span style="color: #98fb98;">loop</span>(<span style="color: #eedd82;">ServerProcessName</span>, <span style="color: #eedd82;">Mod</span>, <span style="color: #eedd82;">State1</span>)
    <span style="color: #00ffff;">end</span>.
</pre>
</div>

<p>
这一小段代码凝聚了服务器的精华。下面给 server1 编写一个回调模块,它是一个 <span class="underline">名称服务器</span> 回调模块:
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #7fffd4;">-module</span>(name_server).
<span style="color: #7fffd4;">-export</span>([<span style="color: #98fb98;">init/0</span>, <span style="color: #98fb98;">add/2</span>, <span style="color: #98fb98;">find/1</span>, <span style="color: #98fb98;">handle/2</span>]).
<span style="color: #7fffd4;">-import</span>(server1, [<span style="color: #98fb98;">rpc/2</span>]).

<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">client routines</span>
<span style="color: #87cefa;">add</span>(<span style="color: #eedd82;">Key</span>, <span style="color: #eedd82;">Value</span>) -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">rpc</span>(name_server, {add, <span style="color: #eedd82;">Key</span>, <span style="color: #eedd82;">Value</span>}).
<span style="color: #87cefa;">find</span>(<span style="color: #eedd82;">Key</span>)       -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">rpc</span>(name_server, {find, <span style="color: #eedd82;">Key</span>}).

<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">callback routines</span>
<span style="color: #87cefa;">init</span>() -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">dict</span>:<span style="color: #98fb98;">new</span>().
<span style="color: #87cefa;">handle</span>({add, <span style="color: #eedd82;">Key</span>, <span style="color: #eedd82;">Value</span>}, <span style="color: #eedd82;">Dict</span>) -&gt;<span style="color: #87cefa;"> </span>{ok, <span style="color: #98fb98;">dict</span>:<span style="color: #98fb98;">store</span>(<span style="color: #eedd82;">Key</span>, <span style="color: #eedd82;">Value</span>, <span style="color: #eedd82;">Dict</span>)};
<span style="color: #87cefa;">handle</span>({find, <span style="color: #eedd82;">Key</span>}, <span style="color: #eedd82;">Dict</span>)       -&gt;<span style="color: #87cefa;"> </span>{<span style="color: #98fb98;">dict</span>:<span style="color: #98fb98;">find</span>(<span style="color: #eedd82;">Key</span>, <span style="color: #eedd82;">Dict</span>), <span style="color: #eedd82;">Dict</span>}.
</pre>
</div>

<p>
这段代码实际上执行两个任务：
</p>
<ul class="org-ul">
<li>首先充当被 <span class="underline">服务器框架代码</span> <b>调用</b> 的 <span class="underline">回调模块</span> ： init 和 handle 函数</li>
<li>它还包含了将被 <span class="underline">客户端</span> <b>调用</b> 的 <span class="underline">接口方法</span> ： add 和 find 函数</li>
</ul>

<pre class="example">
OTP的惯例是把这两类函数放在同一个模块里
</pre>

<p>
为了证明它能工作,可以这么做:
</p>

<div class="org-src-container">
<pre class="src src-sh">5&gt; server1:start(name_server, name_server) <span style="color: #b0c4de;">.</span>  
true

7&gt; name_server:add(joe, <span style="color: #ffa07a;">"at_home"</span>) <span style="color: #b0c4de;">.</span>  
ok

8&gt; name_server:find(joe) <span style="color: #b0c4de;">.</span>             
{ok,<span style="color: #ffa07a;">"at_home"</span>}
</pre>
</div>

<pre class="example">
     现在停下来想一想。这个回调模块没有用于并发的代码,没有创建进程,没有发送消息,没有接收消息,也没有注册进程

     它是纯粹的顺序代码,别无其他。这就意味着我们可以在完全不了解底层并发模型的情况下编写客户端，服务器模型

     这就是所有服务器的基本模式，一旦理解了基本的结构,就可以轻轻松松地“自主研发”了
</pre>
</div>
</div>
