src/erlang/concurrency/otp.org
** 热代码交换
   #+BEGIN_EXAMPLE
     现在将添加热代码交换(hot code swapping)功能

     大多数服务器都执行一个固定的程序,如果要修改服务器的行为,就必须先停止服务器,再用修改后的代码重启它
   #+END_EXAMPLE
   而要修改这个服务器的行为,不用停止它,只需要发送一个包含新代码的消息,它就会提取新代码,然后用新代码和老的会话数据继续工作。这一过程被称为 _热代码交换_ ：

   #+BEGIN_SRC erlang 
  -module(server3).
  -export([start/2, rpc/2, swap_code/2]).

  start(Name, Mod) ->
      register(Name, 
	       spawn(fun() -> loop(Name,Mod,Mod:init()) end)).

  swap_code(Name, Mod) -> rpc(Name, {swap_code, Mod}).

  rpc(Name, Request) ->
      Name ! {self(), Request},
      receive
	  {Name, Response} -> Response
      end.

  loop(Name, Mod, OldState) ->
      receive
	  {From, {swap_code, NewCallBackMod}} ->
	      From ! {Name, ack},
	      loop(Name, NewCallBackMod, OldState);
	  {From, Request} ->
	      {Response, NewState} = Mod:handle(Request, OldState),
	      From ! {Name, Response},
	      loop(Name, Mod, NewState)
      end.
   #+END_SRC

   如果向服务器发送一个交换代码消息,它就会把 _回调模块_ 改为 _消息里包含的新模块_  

   #+BEGIN_EXAMPLE
     可以演示这一点,做法是用某个回调模块启动 server3 ,然后动态交换这个回调模块

     但不能用 name_server 作为回调模块,因为服务器名已经被硬编译进这个模块里了
   #+END_EXAMPLE

   因此,将制作一个名为 _name_server1_ 的副本,然后在里面修改服务器的名称：

   #+BEGIN_SRC erlang 
  -module(name_server1).
  -export([init/0, add/2, find/1, handle/2]).
  -import(server3, [rpc/2]).

  %% client routines
  add(Name, Place) -> rpc(name_server, {add, Name, Place}).
  find(Name)       -> rpc(name_server, {find, Name}).

  %% callback routines
  init() -> dict:new().

  handle({add, Name, Place}, Dict) -> {ok, dict:store(Name, Place, Dict)};
  handle({find, Name}, Dict)       -> {dict:find(Name, Dict), Dict}.
   #+END_SRC

   #+BEGIN_EXAMPLE
     现在假设想要找出这个名称服务器能提供的所有名称

     API里没有函数能做到这一点,因为 name_server_1 模块只包含访问函数 add 和 find 
   #+END_EXAMPLE
   于是我们以闪电般的速度打开文本编辑器并编写一个新的回调模块：

   #+BEGIN_SRC erlang 
  -module(new_name_server).
  -export([init/0, add/2, all_names/0, delete/1, find/1, handle/2]).
  -import(server3, [rpc/2]).

  %% interface
  all_names()      -> rpc(name_server, allNames).
  add(Name, Place) -> rpc(name_server, {add, Name, Place}).
  delete(Name)     -> rpc(name_server, {delete, Name}).
  find(Name)       -> rpc(name_server, {find, Name}).
  %% callback routines
  init() -> dict:new().
    
  handle({add, Name, Place}, Dict) -> {ok, dict:store(Name, Place, Dict)};
  handle(allNames, Dict)           -> {dict:fetch_keys(Dict), Dict};
  handle({delete, Name}, Dict)     -> {ok, dict:erase(Name, Dict)};
  handle({find, Name}, Dict)       -> {dict:find(Name, Dict), Dict}.
   #+END_SRC

   编译这个模块并告知服务器交换它的回调模块：

   #+BEGIN_SRC sh 
  4> c (new_name_server) . 
  {ok,new_name_server}
  5> 
  5> server3:swap_code(name_server, new_name_server) .  
  ack
   #+END_SRC

   现在就可以运行服务器里的新函数了：

   #+BEGIN_SRC sh 
  6> new_name_server:all_names() . 
  [joe,helen]
   #+END_SRC

   在这里实时更换了 _回调模块_ ,这就是 *动态代码升级* ,就发生在你的眼前,没有什么黑魔法

   #+BEGIN_EXAMPLE
     现在再停下来想一想。之前完成的两个任务通常都被认为很有难度,事实的确如此

     编写能实现“事务语义”的服务器很困难,编写能实现动态代码升级的服务器也很困难,但这个方法让它们变得简单了
   #+END_EXAMPLE

   这个方法极其强大。传统上我们认为服务器是有状态的程序,当我们向它发送消息时会改变它的状态。服务器里的代码在首次调用时就固定了,如果想要修改服务器里的代码,就必须停止服务器并修改代码,然后重启服务器

   #+BEGIN_EXAMPLE
     在前面的例子中,修改服务器的代码就像修改服务器的状态那样简单

     我们用这个方法编写了许多产品,它们从来不会因为软件维护升级而停止服务
   #+END_EXAMPLE
