src/erlang/concurrency/otp.org
** 事务与热代码交换
   #+BEGIN_EXAMPLE
     在前两个服务器里,代码升级和事务语义是分开的
   #+END_EXAMPLE
   现在要把它们组合到一个服务器里：

   #+BEGIN_SRC erlang 
  -module(server4).
  -export([start/2, rpc/2, swap_code/2]).

  start(Name, Mod) ->
      register(Name, spawn(fun() -> loop(Name,Mod,Mod:init()) end)).

  swap_code(Name, Mod) -> rpc(Name, {swap_code, Mod}).

  rpc(Name, Request) ->
      Name ! {self(), Request},
      receive
	  {Name, crash} -> exit(rpc);
	  {Name, ok, Response} -> Response
      end.

  loop(Name, Mod, OldState) ->
      receive
	  {From, {swap_code, NewCallbackMod}} ->
	      From ! {Name, ok, ack},
	      loop(Name, NewCallbackMod, OldState);
	  {From, Request} ->
	      try Mod:handle(Request, OldState) of
		  {Response, NewState} ->
		      From ! {Name, ok, Response},
		      loop(Name, Mod, NewState)
	      catch
		  _: Why ->
		      log_the_error(Name, Request, Why),
		      From ! {Name, crash},
		      loop(Name, Mod, OldState)
	      end
      end.

  log_the_error(Name, Request, Why) ->
      io:format("Server ~p request ~p ~n"
		"caused exception ~p~n", 
		[Name, Request, Why]).
   #+END_SRC

   这个服务器同时提供了热代码交换和事务语义,干净利落!
** 更多乐趣
   理解动态代码变换的概念之后,就能找到更多乐趣。这里有一个服务器,它不会做任何事,直到你 *通知* 它变成 _某一种类型_ 的服务器:

   #+BEGIN_SRC erlang 
  -module(server5).
  -export([start/0, rpc/2]).
  start() -> spawn(fun() -> wait() end).
  wait() ->
      receive
	  {become, F} -> F()
      end.
  rpc(Pid, Q) ->
      Pid ! {self(), Q},
      receive
	  {Pid, Reply} -> Reply
      end.
   #+END_SRC

   如果启动它并向它 *发送* 一个 _{become, F}_ 消息,它就会变成一个 *执行* _F() 函数_ 的 _F 服务器_ 

   #+BEGIN_SRC sh 
  4> Pid = server5:start() . 
  <0.50.0>
   #+END_SRC

   #+BEGIN_EXAMPLE
     现在这个服务器不做任何事,只是在等待一个 become 消息
   #+END_EXAMPLE

   现在来定义一个服务器函数。没什么复杂的,只是计算阶乘而已：

   #+BEGIN_SRC erlang 
  -module(my_fac_server).
  -export([loop/0]).

  loop() ->
      receive
	  {From, {fac, N}} ->
	      From ! {self(), fac(N)},
	      loop();
	  {become, Something} ->
	      Something()
      end.
    
  fac(0) -> 1;
  fac(N) -> N * fac(N-1).
   #+END_SRC
   确保它成功编译之后,就可以通知进程 <0.50.0> 变成一个阶乘服务器了。
   #+BEGIN_SRC sh 
  5> Pid ! {become, fun my_fac_server:loop/0} . 
  {become,#Fun<my_fac_server.loop.0>}
   #+END_SRC

   现在这个进程已经变成一个阶乘服务器了,试着来调用它：
   #+BEGIN_SRC sh 
  6> server5:rpc(Pid, {fac, 30}) . 
  265252859812191058636308480000000
   #+END_SRC
   这个进程会一直扮演阶乘服务器的角色,直到向它发送一个 _{become, Something}_ 消息来告诉它做点别的什么 

   #+BEGIN_EXAMPLE
     几年前,当我还在做研究的时候,曾经与PlanetLab一起共事。我能访问PlanetLab网络(它是一个全球范围的研究网络:http://www.planet-lab.org),所以我在PlanetLab的所有(大约450台)机器上都安装了“空白”的Erlang服务器。当时我并不知道要拿这些机器来做什么,因此只是设立了服务器架构以供将来使用

     让这层架构运行起来之后,我很容易就能向这些空白服务器发送消息来让它们变成真正的服务器

     举个例子,通常的做法是启用一个Web服务器,然后安装Web服务器插件。我的做法是后退一步,先安装一个空白服务器,以后再让插件把它转变成Web服务器。当我们不再需要Web服务器时,就可以把它变成别的东西
   #+END_EXAMPLE

*** 思考
    #+BEGIN_EXAMPLE
      正如在前面这些例子中所看见的,可以制作各种不同类型的服务器,让它们具有不同的语义和一些相当惊人的属性

      这个方法实在是太过强大,如果彻底发挥它的潜力,就能生成拥有惊人威力和美感的小程序

      如果我们的项目是工业规模的,涉及成百上千个程序员,或许并不想让事情过于动态，既要兼顾通用性和威力,又要满足商业产品的需要

      让代码能在运行时更换新版这一点很美好,但之后如果出了错则会成为调试者的噩梦。如果数十次动态改动代码,而它随后崩溃了,那么找出准确的错误原因可不是一件容易的事
    #+END_EXAMPLE

    Erlang的 gen_server 模块是不断强化的服务器(就像在本章里编写的那些)逐渐形成的逻辑成果

    #+BEGIN_EXAMPLE
      它从1998年起就被用于工业产品。一个产品可以包含数百个服务器,这些服务器正是程序员使用普通的顺序代码编写的

      所有的错误处理和非业务行为都被排除在服务器的通用部分之外
    #+END_EXAMPLE

    现在将跨越想象,来看看真正的 gen_server 

* gen_server 入门
  我将直接把你扔进深水区。以下三点是编写 gen_server 回调模块的简要步骤。
  1. 确定回调模块名
  2. 编写接口函数
  3. 在回调模块里编写六个必需的回调函数 

  #+BEGIN_EXAMPLE
    这真的很简单。不要多想,只需按步骤行事!
  #+END_EXAMPLE

** 确定回调模块名
   接下来将制作一个简单的支付系统。把这个模块称为 my_bank:

