html/erlang/concurrency/otp.html
<div id="outline-container-org79adf5a" class="outline-3">
<h3 id="org79adf5a">事务与热代码交换</h3>
<div class="outline-text-3" id="text-org79adf5a">
<pre class="example">
     在前两个服务器里,代码升级和事务语义是分开的
</pre>
<p>
现在要把它们组合到一个服务器里：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #7fffd4;">-module</span>(server4).
<span style="color: #7fffd4;">-export</span>([<span style="color: #98fb98;">start/2</span>, <span style="color: #98fb98;">rpc/2</span>, <span style="color: #98fb98;">swap_code/2</span>]).

<span style="color: #87cefa;">start</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Mod</span>) -&gt;
    <span style="color: #b0c4de;">register</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #b0c4de;">spawn</span>(<span style="color: #00ffff;">fun</span>() -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">loop</span>(<span style="color: #eedd82;">Name</span>,<span style="color: #eedd82;">Mod</span>,<span style="color: #eedd82;">Mod</span>:<span style="color: #98fb98;">init</span>()) <span style="color: #00ffff;">end</span>)).

<span style="color: #87cefa;">swap_code</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Mod</span>) -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">rpc</span>(<span style="color: #eedd82;">Name</span>, {swap_code, <span style="color: #eedd82;">Mod</span>}).

<span style="color: #87cefa;">rpc</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Request</span>) -&gt;
    <span style="color: #eedd82;">Name</span> ! {<span style="color: #b0c4de;">self</span>(), <span style="color: #eedd82;">Request</span>},
    <span style="color: #00ffff;">receive</span>
        {<span style="color: #eedd82;">Name</span>, crash} -&gt;<span style="color: #87cefa;"> </span><span style="color: #b0c4de;">exit</span>(rpc);
        {<span style="color: #eedd82;">Name</span>, ok, <span style="color: #eedd82;">Response</span>} -&gt;<span style="color: #87cefa;"> </span><span style="color: #eedd82;">Response</span>
    <span style="color: #00ffff;">end</span>.

<span style="color: #87cefa;">loop</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Mod</span>, <span style="color: #eedd82;">OldState</span>) -&gt;
    <span style="color: #00ffff;">receive</span>
        {<span style="color: #eedd82;">From</span>, {swap_code, <span style="color: #eedd82;">NewCallbackMod</span>}} -&gt;
            <span style="color: #eedd82;">From</span> ! {<span style="color: #eedd82;">Name</span>, ok, ack},
            <span style="color: #98fb98;">loop</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">NewCallbackMod</span>, <span style="color: #eedd82;">OldState</span>);
        {<span style="color: #eedd82;">From</span>, <span style="color: #eedd82;">Request</span>} -&gt;
            <span style="color: #00ffff;">try</span> <span style="color: #eedd82;">Mod</span>:<span style="color: #98fb98;">handle</span>(<span style="color: #eedd82;">Request</span>, <span style="color: #eedd82;">OldState</span>) <span style="color: #00ffff;">of</span>
                {<span style="color: #eedd82;">Response</span>, <span style="color: #eedd82;">NewState</span>} -&gt;
                    <span style="color: #eedd82;">From</span> ! {<span style="color: #eedd82;">Name</span>, ok, <span style="color: #eedd82;">Response</span>},
                    <span style="color: #98fb98;">loop</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Mod</span>, <span style="color: #eedd82;">NewState</span>)
            <span style="color: #00ffff;">catch</span>
                <span style="color: #eedd82;">_</span>: <span style="color: #eedd82;">Why</span> -&gt;
                    <span style="color: #98fb98;">log_the_error</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Request</span>, <span style="color: #eedd82;">Why</span>),
                    <span style="color: #eedd82;">From</span> ! {<span style="color: #eedd82;">Name</span>, crash},
                    <span style="color: #98fb98;">loop</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Mod</span>, <span style="color: #eedd82;">OldState</span>)
            <span style="color: #00ffff;">end</span>
    <span style="color: #00ffff;">end</span>.

<span style="color: #87cefa;">log_the_error</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Request</span>, <span style="color: #eedd82;">Why</span>) -&gt;
    <span style="color: #98fb98;">io</span>:<span style="color: #98fb98;">format</span>(<span style="color: #ffa07a;">"Server ~p request ~p ~n"</span>
              <span style="color: #ffa07a;">"caused exception ~p~n"</span>, 
              [<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Request</span>, <span style="color: #eedd82;">Why</span>]).
</pre>
</div>

<p>
这个服务器同时提供了热代码交换和事务语义,干净利落!
</p>
</div>
</div>
<div id="outline-container-orge89402d" class="outline-3">
<h3 id="orge89402d">更多乐趣</h3>
<div class="outline-text-3" id="text-orge89402d">
<p>
理解动态代码变换的概念之后,就能找到更多乐趣。这里有一个服务器,它不会做任何事,直到你 <b>通知</b> 它变成 <span class="underline">某一种类型</span> 的服务器:
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #7fffd4;">-module</span>(server5).
<span style="color: #7fffd4;">-export</span>([<span style="color: #98fb98;">start/0</span>, <span style="color: #98fb98;">rpc/2</span>]).
<span style="color: #87cefa;">start</span>() -&gt;<span style="color: #87cefa;"> </span><span style="color: #b0c4de;">spawn</span>(<span style="color: #00ffff;">fun</span>() -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">wait</span>() <span style="color: #00ffff;">end</span>).
<span style="color: #87cefa;">wait</span>() -&gt;
    <span style="color: #00ffff;">receive</span>
        {become, <span style="color: #eedd82;">F</span>} -&gt;<span style="color: #87cefa;"> </span><span style="color: #eedd82;">F</span>()
    <span style="color: #00ffff;">end</span>.
<span style="color: #87cefa;">rpc</span>(<span style="color: #eedd82;">Pid</span>, <span style="color: #eedd82;">Q</span>) -&gt;
    <span style="color: #eedd82;">Pid</span> ! {<span style="color: #b0c4de;">self</span>(), <span style="color: #eedd82;">Q</span>},
    <span style="color: #00ffff;">receive</span>
        {<span style="color: #eedd82;">Pid</span>, <span style="color: #eedd82;">Reply</span>} -&gt;<span style="color: #87cefa;"> </span><span style="color: #eedd82;">Reply</span>
    <span style="color: #00ffff;">end</span>.
</pre>
</div>

<p>
如果启动它并向它 <b>发送</b> 一个 <span class="underline">{become, F}</span> 消息,它就会变成一个 <b>执行</b> <span class="underline">F() 函数</span> 的 <span class="underline">F 服务器</span> 
</p>

<div class="org-src-container">
<pre class="src src-sh">4&gt; Pid = server5:start() <span style="color: #b0c4de;">.</span> 
&lt;0.50.0&gt;
</pre>
</div>

<pre class="example">
     现在这个服务器不做任何事,只是在等待一个 become 消息
</pre>

<p>
现在来定义一个服务器函数。没什么复杂的,只是计算阶乘而已：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #7fffd4;">-module</span>(my_fac_server).
<span style="color: #7fffd4;">-export</span>([<span style="color: #98fb98;">loop/0</span>]).

<span style="color: #87cefa;">loop</span>() -&gt;
    <span style="color: #00ffff;">receive</span>
        {<span style="color: #eedd82;">From</span>, {fac, <span style="color: #eedd82;">N</span>}} -&gt;
            <span style="color: #eedd82;">From</span> ! {<span style="color: #b0c4de;">self</span>(), <span style="color: #98fb98;">fac</span>(<span style="color: #eedd82;">N</span>)},
            <span style="color: #98fb98;">loop</span>();
        {become, <span style="color: #eedd82;">Something</span>} -&gt;
            <span style="color: #eedd82;">Something</span>()
    <span style="color: #00ffff;">end</span>.

<span style="color: #87cefa;">fac</span>(0) -&gt;<span style="color: #87cefa;"> </span>1;
<span style="color: #87cefa;">fac</span>(<span style="color: #eedd82;">N</span>) -&gt;<span style="color: #87cefa;"> </span><span style="color: #eedd82;">N</span> * <span style="color: #98fb98;">fac</span>(<span style="color: #eedd82;">N</span>-1).
</pre>
</div>
<p>
确保它成功编译之后,就可以通知进程 &lt;0.50.0&gt; 变成一个阶乘服务器了。
</p>
<div class="org-src-container">
<pre class="src src-sh">5&gt; Pid ! {become, fun my_fac_server:loop/0} <span style="color: #b0c4de;">.</span> 
{become,#Fun&lt;my_fac_server.loop.0&gt;}
</pre>
</div>

<p>
现在这个进程已经变成一个阶乘服务器了,试着来调用它：
</p>
<div class="org-src-container">
<pre class="src src-sh">6&gt; server5:rpc(Pid, {fac, 30}) <span style="color: #b0c4de;">.</span> 
265252859812191058636308480000000
</pre>
</div>
<p>
这个进程会一直扮演阶乘服务器的角色,直到向它发送一个 <span class="underline">{become, Something}</span> 消息来告诉它做点别的什么 
</p>

<pre class="example">
     几年前,当我还在做研究的时候,曾经与PlanetLab一起共事。我能访问PlanetLab网络(它是一个全球范围的研究网络:http://www.planet-lab.org),所以我在PlanetLab的所有(大约450台)机器上都安装了“空白”的Erlang服务器。当时我并不知道要拿这些机器来做什么,因此只是设立了服务器架构以供将来使用

     让这层架构运行起来之后,我很容易就能向这些空白服务器发送消息来让它们变成真正的服务器

     举个例子,通常的做法是启用一个Web服务器,然后安装Web服务器插件。我的做法是后退一步,先安装一个空白服务器,以后再让插件把它转变成Web服务器。当我们不再需要Web服务器时,就可以把它变成别的东西
</pre>
</div>

<div id="outline-container-orge0ee7cd" class="outline-4">
<h4 id="orge0ee7cd">思考</h4>
<div class="outline-text-4" id="text-orge0ee7cd">
<pre class="example">
      正如在前面这些例子中所看见的,可以制作各种不同类型的服务器,让它们具有不同的语义和一些相当惊人的属性

      这个方法实在是太过强大,如果彻底发挥它的潜力,就能生成拥有惊人威力和美感的小程序

      如果我们的项目是工业规模的,涉及成百上千个程序员,或许并不想让事情过于动态，既要兼顾通用性和威力,又要满足商业产品的需要

      让代码能在运行时更换新版这一点很美好,但之后如果出了错则会成为调试者的噩梦。如果数十次动态改动代码,而它随后崩溃了,那么找出准确的错误原因可不是一件容易的事
</pre>

<p>
Erlang的 gen_server 模块是不断强化的服务器(就像在本章里编写的那些)逐渐形成的逻辑成果
</p>

<pre class="example">
      它从1998年起就被用于工业产品。一个产品可以包含数百个服务器,这些服务器正是程序员使用普通的顺序代码编写的

      所有的错误处理和非业务行为都被排除在服务器的通用部分之外
</pre>

<p>
现在将跨越想象,来看看真正的 gen_server 
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org4fc5bbf" class="outline-2">
<h2 id="org4fc5bbf">gen_server 入门</h2>
<div class="outline-text-2" id="text-org4fc5bbf">
<p>
我将直接把你扔进深水区。以下三点是编写 gen_server 回调模块的简要步骤。
</p>
<ol class="org-ol">
<li>确定回调模块名</li>
<li>编写接口函数</li>
<li>在回调模块里编写六个必需的回调函数</li>
</ol>

<pre class="example">
    这真的很简单。不要多想,只需按步骤行事!
</pre>
</div>

<div id="outline-container-orgbdad234" class="outline-3">
<h3 id="orgbdad234">确定回调模块名</h3>
<div class="outline-text-3" id="text-orgbdad234">
<p>
接下来将制作一个简单的支付系统。把这个模块称为 my_bank:
</p>
</div>
</div>
