src/erlang/concurrency/otp.org
** 编写接口方法
   定义五个接口方法,它们都在 my_bank 模块里：
   1. start(): 打开银行
   2. stop(): 关闭银行
   3. new_account(Who): 创建一个新账户
   4. deposit(Who, Amount): 把钱存入银行
   5. withdraw(Who, Amount): 把钱取出来(如果有结余的话) 

   每个函数都正好对应一个 gen_server 方法调用,代码如下:
   #+BEGIN_SRC erlang 
  start() -> gen_server:start_link({local, ?SERVER}, ?MODULE, [], []).

  stop()  -> gen_server:call(?MODULE, stop).

  new_account(Who)      -> gen_server:call(?MODULE, {new, Who}). 

  deposit(Who, Amount)  -> gen_server:call(?MODULE, {add, Who, Amount}). 

  withdraw(Who, Amount) -> gen_server:call(?MODULE, {remove, Who, Amount}). 
   #+END_SRC

   _gen_server:start_link({local, Name}, Mod, ...)_ 会 *启动* 一个 _本地服务器_ ：
   + 如果第一个参数是原子 _global_ ,它就会启动一个能被Erlang节点集群访问的 _全局服务器_
   + 第二个参数是 _Mod_ ,也就是 *回调模块名* 
     + 宏 _?MODULE_ 会 *展开* 成 _模块名_ my_bank 
   #+BEGIN_EXAMPLE
     目前我们将忽略gen_server:start_link 的其他参数
   #+END_EXAMPLE
   + _gen_server:call(?MODULE, Term)_ 被用来对 _服务器_ 进行 *远程过程调用*  

