html/erlang/concurrency/otp.html

<div id="outline-container-org877603b" class="outline-3">
<h3 id="org877603b">编写接口方法</h3>
<div class="outline-text-3" id="text-org877603b">
<p>
定义五个接口方法,它们都在 my_bank 模块里：
</p>
<ol class="org-ol">
<li>start(): 打开银行</li>
<li>stop(): 关闭银行</li>
<li>new_account(Who): 创建一个新账户</li>
<li>deposit(Who, Amount): 把钱存入银行</li>
<li>withdraw(Who, Amount): 把钱取出来(如果有结余的话)</li>
</ol>

<p>
每个函数都正好对应一个 gen_server 方法调用,代码如下:
</p>
<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #87cefa;">start</span>() -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">gen_server</span>:<span style="color: #98fb98;">start_link</span>({local, ?<span style="color: #7fffd4;">SERVER</span>}, ?<span style="color: #7fffd4;">MODULE</span>, [], []).

<span style="color: #87cefa;">stop</span>()  -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">gen_server</span>:<span style="color: #98fb98;">call</span>(?<span style="color: #7fffd4;">MODULE</span>, stop).

<span style="color: #87cefa;">new_account</span>(<span style="color: #eedd82;">Who</span>)      -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">gen_server</span>:<span style="color: #98fb98;">call</span>(?<span style="color: #7fffd4;">MODULE</span>, {new, <span style="color: #eedd82;">Who</span>}). 

<span style="color: #87cefa;">deposit</span>(<span style="color: #eedd82;">Who</span>, <span style="color: #eedd82;">Amount</span>)  -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">gen_server</span>:<span style="color: #98fb98;">call</span>(?<span style="color: #7fffd4;">MODULE</span>, {add, <span style="color: #eedd82;">Who</span>, <span style="color: #eedd82;">Amount</span>}). 

<span style="color: #87cefa;">withdraw</span>(<span style="color: #eedd82;">Who</span>, <span style="color: #eedd82;">Amount</span>) -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">gen_server</span>:<span style="color: #98fb98;">call</span>(?<span style="color: #7fffd4;">MODULE</span>, {remove, <span style="color: #eedd82;">Who</span>, <span style="color: #eedd82;">Amount</span>}). 
</pre>
</div>

<p>
<span class="underline">gen_server:start_link({local, Name}, Mod, &#x2026;)</span> 会 <b>启动</b> 一个 <span class="underline">本地服务器</span> ：
</p>
<ul class="org-ul">
<li>如果第一个参数是原子 <span class="underline">global</span> ,它就会启动一个能被Erlang节点集群访问的 <span class="underline">全局服务器</span></li>
<li>第二个参数是 <span class="underline">Mod</span> ,也就是 <b>回调模块名</b> 
<ul class="org-ul">
<li>宏 <span class="underline">?MODULE</span> 会 <b>展开</b> 成 <span class="underline">模块名</span> my_bank</li>
</ul></li>
</ul>
<pre class="example">
     目前我们将忽略gen_server:start_link 的其他参数
</pre>
<ul class="org-ul">
<li><span class="underline">gen_server:call(?MODULE, Term)</span> 被用来对 <span class="underline">服务器</span> 进行 <b>远程过程调用</b></li>
</ul>
</div>
</div>
