src/erlang/concurrency/otp.org
** 编写回调方法
   回调模块必须实现并导出六个回调方法: 
   + init/1
   + handle_call/3
   + handle_cast/2
   + handle_info/2
   + terminate/2
   + code_change/3 

   为简单起见,可以使用一些模板来制作 gen_server 。下面是最简单的一种:

   #+BEGIN_SRC erlang 
  -module().
  %% gen_server_mini_template
  -behaviour(gen_server).
  -export([start_link/0]).
  %% gen_server callbacks
  -export([init/1, handle_call/3, handle_cast/2, handle_info/2,
	   terminate/2, code_change/3]).

  start_link() -> gen_server:start_link({local, ?SERVER}, ?MODULE, [], []).
  init([]) -> {ok, State}.

  handle_call(_Request, _From, State) -> {reply, Reply, State}.
  handle_cast(_Msg, State) -> {noreply, State}.
  handle_info(_Info, State) -> {noreply, State}.
  terminate(_Reason, _State) -> ok.
  code_change(_OldVsn, State, Extra) -> {ok, State}.
   #+END_SRC

   这个模板包含了一套简单的框架,可以填充它们来制作服务器：
   + 如果忘记定义合适的回调函数,编译器就会根据关键字 -behaviour 来生成警告或错误消息
   + start_link() 函数里的服务器名 _宏 ?SERVER_ 需要进行定义,因为它默认是没有定义的

   #+BEGIN_EXAMPLE
     如果正在使用Emacs,那么敲几下按键就能调入一个 gen_server 模板

     在erlang-mode(Erlang模式)下编辑,则可以通过 Erlang > Skeletons 菜单生成的标签页来创建一个 gen_server 模板

     接着就从模板入手,对它稍作修改：要做的就是让接口方法里的参数与模板里的参数保持一致
   #+END_EXAMPLE

   handle_call/3 函数最为重要。必须编写代码,让它匹配接口方法里定义的三种查询数据类型。也就是说,必须填写以下代码里的这些点:

   #+BEGIN_SRC erlang 
  handle_call({new, Who}, From, State) ->
	  Reply = ...  
	  State1 = ...  
	  {reply, Reply, State1};
  handle_call({add, Who, Amount}, From, State) ->
	  Reply = ...  
	  State1 = ...  
	  {reply, Reply, State1};
  handle_call({remove, Who, Amount}, From, State) ->
	  Reply = ...  
	  State1 = ...  
	  {reply, Reply, State1};
   #+END_SRC

   这段代码：
   + Reply ：作为 _远程过程调用_ 的 *返回值* 发回客户端
   + State : 一个代表 _服务器全局状态_ 的 *变量* ,它会在 _服务器_ 里 *到处传递* 
     + 在我们的银行模块里,这个状态永远不会发生变化,它只是一个 _ETS表的索引_ ,属于 *常量* (虽然表的内容会变化) 

   填写模板并稍加改动之后,就形成了以下代码:

   #+BEGIN_SRC erlang 
  init([]) -> {ok, ets:new(?MODULE,[])}.

  handle_call({new,Who}, _From, Tab) ->
      Reply = case ets:lookup(Tab, Who) of
		  []  -> ets:insert(Tab, {Who,0}), 
			 {welcome, Who};
		  [_] -> {Who, you_already_are_a_customer}
	      end,
      {reply, Reply, Tab};
	
  handle_call({add,Who,X}, _From, Tab) ->
      Reply = case ets:lookup(Tab, Who) of
		  []  -> not_a_customer;
		  [{Who,Balance}] ->
		      NewBalance = Balance + X,
		      ets:insert(Tab, {Who, NewBalance}),
		      {thanks, Who, your_balance_is,  NewBalance}	
	      end,
      {reply, Reply, Tab};
	
  handle_call({remove,Who, X}, _From, Tab) ->
      Reply = case ets:lookup(Tab, Who) of
		  []  -> not_a_customer;
		  [{Who,Balance}] when X =< Balance ->
		      NewBalance = Balance - X,
		      ets:insert(Tab, {Who, NewBalance}),
		      {thanks, Who, your_balance_is,  NewBalance};	
		  [{Who,Balance}] ->
		      {sorry,Who,you_only_have,Balance,in_the_bank}
	      end,
      {reply, Reply, Tab};
	
  handle_call(stop, _From, Tab) ->
      {stop, normal, stopped, Tab}.
  handle_cast(_Msg, State) -> {noreply, State}.
  handle_info(_Info, State) -> {noreply, State}.
  terminate(_Reason, _State) -> ok.
  code_change(_OldVsn, State, _Extra) -> {ok, State}.
   #+END_SRC

   + 调用 gen_server:start_link(Name, CallBackMod, StartArgs, Opts) 来启动服务器：
     + 第一个被调用的回调模块方法是 _Mod:init(StartArgs)_ ,它必须返回 _{ok, State}_
     + State 的值作为 _handle_call_ 的 _第三个参数_ 重新出现
   + 请注意是如何停止服务器的: handle_call(stop, From, Tab) 返回 {stop, normal, stopped, Tab} ,它会停止服务器
     + 第二个参数 _normal_ 被用作 _my_bank:terminate/2_ 的 _首个参数_
     + 第三个参数 _stopped_ 会成为 _my_bank:stop()_ 的 _返回值_ 

   #+BEGIN_EXAMPLE
     就是这样,我们的开发任务已经完成了
   #+END_EXAMPLE

