html/erlang/concurrency/otp.html

<div id="outline-container-org5b34c42" class="outline-3">
<h3 id="org5b34c42">编写回调方法</h3>
<div class="outline-text-3" id="text-org5b34c42">
<p>
回调模块必须实现并导出六个回调方法: 
</p>
<ul class="org-ul">
<li>init/1</li>
<li>handle_call/3</li>
<li>handle_cast/2</li>
<li>handle_info/2</li>
<li>terminate/2</li>
<li>code_change/3</li>
</ul>

<p>
为简单起见,可以使用一些模板来制作 gen_server 。下面是最简单的一种:
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #7fffd4;">-module</span>().
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">gen_server_mini_template</span>
<span style="color: #7fffd4;">-behaviour</span>(gen_server).
<span style="color: #7fffd4;">-export</span>([<span style="color: #98fb98;">start_link/0</span>]).
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">gen_server callbacks</span>
<span style="color: #7fffd4;">-export</span>([<span style="color: #98fb98;">init/1</span>, <span style="color: #98fb98;">handle_call/3</span>, <span style="color: #98fb98;">handle_cast/2</span>, <span style="color: #98fb98;">handle_info/2</span>,
         <span style="color: #98fb98;">terminate/2</span>, <span style="color: #98fb98;">code_change/3</span>]).

<span style="color: #87cefa;">start_link</span>() -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">gen_server</span>:<span style="color: #98fb98;">start_link</span>({local, ?<span style="color: #7fffd4;">SERVER</span>}, ?<span style="color: #7fffd4;">MODULE</span>, [], []).
<span style="color: #87cefa;">init</span>([]) -&gt;<span style="color: #87cefa;"> </span>{ok, <span style="color: #eedd82;">State</span>}.

<span style="color: #87cefa;">handle_call</span>(<span style="color: #eedd82;">_Request</span>, <span style="color: #eedd82;">_From</span>, <span style="color: #eedd82;">State</span>) -&gt;<span style="color: #87cefa;"> </span>{reply, <span style="color: #eedd82;">Reply</span>, <span style="color: #eedd82;">State</span>}.
<span style="color: #87cefa;">handle_cast</span>(<span style="color: #eedd82;">_Msg</span>, <span style="color: #eedd82;">State</span>) -&gt;<span style="color: #87cefa;"> </span>{noreply, <span style="color: #eedd82;">State</span>}.
<span style="color: #87cefa;">handle_info</span>(<span style="color: #eedd82;">_Info</span>, <span style="color: #eedd82;">State</span>) -&gt;<span style="color: #87cefa;"> </span>{noreply, <span style="color: #eedd82;">State</span>}.
<span style="color: #87cefa;">terminate</span>(<span style="color: #eedd82;">_Reason</span>, <span style="color: #eedd82;">_State</span>) -&gt;<span style="color: #87cefa;"> </span>ok.
<span style="color: #87cefa;">code_change</span>(<span style="color: #eedd82;">_OldVsn</span>, <span style="color: #eedd82;">State</span>, <span style="color: #eedd82;">Extra</span>) -&gt;<span style="color: #87cefa;"> </span>{ok, <span style="color: #eedd82;">State</span>}.
</pre>
</div>

<p>
这个模板包含了一套简单的框架,可以填充它们来制作服务器：
</p>
<ul class="org-ul">
<li>如果忘记定义合适的回调函数,编译器就会根据关键字 -behaviour 来生成警告或错误消息</li>
<li>start_link() 函数里的服务器名 <span class="underline">宏 ?SERVER</span> 需要进行定义,因为它默认是没有定义的</li>
</ul>

<pre class="example">
     如果正在使用Emacs,那么敲几下按键就能调入一个 gen_server 模板

     在erlang-mode(Erlang模式)下编辑,则可以通过 Erlang &gt; Skeletons 菜单生成的标签页来创建一个 gen_server 模板

     接着就从模板入手,对它稍作修改：要做的就是让接口方法里的参数与模板里的参数保持一致
</pre>

<p>
handle_call/3 函数最为重要。必须编写代码,让它匹配接口方法里定义的三种查询数据类型。也就是说,必须填写以下代码里的这些点:
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #87cefa;">handle_call</span>({new, <span style="color: #eedd82;">Who</span>}, <span style="color: #eedd82;">From</span>, <span style="color: #eedd82;">State</span>) -&gt;
        <span style="color: #eedd82;">Reply</span> = ...  
        <span style="color: #eedd82;">State1</span> = ...  
        {reply, <span style="color: #eedd82;">Reply</span>, <span style="color: #eedd82;">State1</span>};
<span style="color: #87cefa;">handle_call</span>({add, <span style="color: #eedd82;">Who</span>, <span style="color: #eedd82;">Amount</span>}, <span style="color: #eedd82;">From</span>, <span style="color: #eedd82;">State</span>) -&gt;
        <span style="color: #eedd82;">Reply</span> = ...  
        <span style="color: #eedd82;">State1</span> = ...  
        {reply, <span style="color: #eedd82;">Reply</span>, <span style="color: #eedd82;">State1</span>};
<span style="color: #87cefa;">handle_call</span>({remove, <span style="color: #eedd82;">Who</span>, <span style="color: #eedd82;">Amount</span>}, <span style="color: #eedd82;">From</span>, <span style="color: #eedd82;">State</span>) -&gt;
        <span style="color: #eedd82;">Reply</span> = ...  
        <span style="color: #eedd82;">State1</span> = ...  
        {reply, <span style="color: #eedd82;">Reply</span>, <span style="color: #eedd82;">State1</span>};
</pre>
</div>

<p>
这段代码：
</p>
<ul class="org-ul">
<li>Reply ：作为 <span class="underline">远程过程调用</span> 的 <b>返回值</b> 发回客户端</li>
<li>State : 一个代表 <span class="underline">服务器全局状态</span> 的 <b>变量</b> ,它会在 <span class="underline">服务器</span> 里 <b>到处传递</b> 
<ul class="org-ul">
<li>在我们的银行模块里,这个状态永远不会发生变化,它只是一个 <span class="underline">ETS表的索引</span> ,属于 <b>常量</b> (虽然表的内容会变化)</li>
</ul></li>
</ul>

<p>
填写模板并稍加改动之后,就形成了以下代码:
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #87cefa;">init</span>([]) -&gt;<span style="color: #87cefa;"> </span>{ok, <span style="color: #98fb98;">ets</span>:<span style="color: #98fb98;">new</span>(?<span style="color: #7fffd4;">MODULE</span>,[])}.

<span style="color: #87cefa;">handle_call</span>({new,<span style="color: #eedd82;">Who</span>}, <span style="color: #eedd82;">_From</span>, <span style="color: #eedd82;">Tab</span>) -&gt;
    <span style="color: #eedd82;">Reply</span> = <span style="color: #00ffff;">case</span> <span style="color: #98fb98;">ets</span>:<span style="color: #98fb98;">lookup</span>(<span style="color: #eedd82;">Tab</span>, <span style="color: #eedd82;">Who</span>) <span style="color: #00ffff;">of</span>
                []  -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">ets</span>:<span style="color: #98fb98;">insert</span>(<span style="color: #eedd82;">Tab</span>, {<span style="color: #eedd82;">Who</span>,0}), 
                       {welcome, <span style="color: #eedd82;">Who</span>};
                [<span style="color: #eedd82;">_</span>] -&gt;<span style="color: #87cefa;"> </span>{<span style="color: #eedd82;">Who</span>, you_already_are_a_customer}
            <span style="color: #00ffff;">end</span>,
    {reply, <span style="color: #eedd82;">Reply</span>, <span style="color: #eedd82;">Tab</span>};

<span style="color: #87cefa;">handle_call</span>({add,<span style="color: #eedd82;">Who</span>,<span style="color: #eedd82;">X</span>}, <span style="color: #eedd82;">_From</span>, <span style="color: #eedd82;">Tab</span>) -&gt;
    <span style="color: #eedd82;">Reply</span> = <span style="color: #00ffff;">case</span> <span style="color: #98fb98;">ets</span>:<span style="color: #98fb98;">lookup</span>(<span style="color: #eedd82;">Tab</span>, <span style="color: #eedd82;">Who</span>) <span style="color: #00ffff;">of</span>
                []  -&gt;<span style="color: #87cefa;"> </span>not_a_customer;
                [{<span style="color: #eedd82;">Who</span>,<span style="color: #eedd82;">Balance</span>}] -&gt;
                    <span style="color: #eedd82;">NewBalance</span> = <span style="color: #eedd82;">Balance</span> + <span style="color: #eedd82;">X</span>,
                    <span style="color: #98fb98;">ets</span>:<span style="color: #98fb98;">insert</span>(<span style="color: #eedd82;">Tab</span>, {<span style="color: #eedd82;">Who</span>, <span style="color: #eedd82;">NewBalance</span>}),
                    {thanks, <span style="color: #eedd82;">Who</span>, your_balance_is,  <span style="color: #eedd82;">NewBalance</span>} 
            <span style="color: #00ffff;">end</span>,
    {reply, <span style="color: #eedd82;">Reply</span>, <span style="color: #eedd82;">Tab</span>};

<span style="color: #87cefa;">handle_call</span>({remove,<span style="color: #eedd82;">Who</span>, <span style="color: #eedd82;">X</span>}, <span style="color: #eedd82;">_From</span>, <span style="color: #eedd82;">Tab</span>) -&gt;
    <span style="color: #eedd82;">Reply</span> = <span style="color: #00ffff;">case</span> <span style="color: #98fb98;">ets</span>:<span style="color: #98fb98;">lookup</span>(<span style="color: #eedd82;">Tab</span>, <span style="color: #eedd82;">Who</span>) <span style="color: #00ffff;">of</span>
                []  -&gt;<span style="color: #87cefa;"> </span>not_a_customer;
                [{<span style="color: #eedd82;">Who</span>,<span style="color: #eedd82;">Balance</span>}] <span style="color: #00ffff;">when</span> <span style="color: #eedd82;">X</span> =&lt; <span style="color: #eedd82;">Balance</span> -&gt;
                    <span style="color: #eedd82;">NewBalance</span> = <span style="color: #eedd82;">Balance</span> - <span style="color: #eedd82;">X</span>,
                    <span style="color: #98fb98;">ets</span>:<span style="color: #98fb98;">insert</span>(<span style="color: #eedd82;">Tab</span>, {<span style="color: #eedd82;">Who</span>, <span style="color: #eedd82;">NewBalance</span>}),
                    {thanks, <span style="color: #eedd82;">Who</span>, your_balance_is,  <span style="color: #eedd82;">NewBalance</span>};        
                [{<span style="color: #eedd82;">Who</span>,<span style="color: #eedd82;">Balance</span>}] -&gt;
                    {sorry,<span style="color: #eedd82;">Who</span>,you_only_have,<span style="color: #eedd82;">Balance</span>,in_the_bank}
            <span style="color: #00ffff;">end</span>,
    {reply, <span style="color: #eedd82;">Reply</span>, <span style="color: #eedd82;">Tab</span>};

<span style="color: #87cefa;">handle_call</span>(stop, <span style="color: #eedd82;">_From</span>, <span style="color: #eedd82;">Tab</span>) -&gt;
    {stop, normal, stopped, <span style="color: #eedd82;">Tab</span>}.
<span style="color: #87cefa;">handle_cast</span>(<span style="color: #eedd82;">_Msg</span>, <span style="color: #eedd82;">State</span>) -&gt;<span style="color: #87cefa;"> </span>{noreply, <span style="color: #eedd82;">State</span>}.
<span style="color: #87cefa;">handle_info</span>(<span style="color: #eedd82;">_Info</span>, <span style="color: #eedd82;">State</span>) -&gt;<span style="color: #87cefa;"> </span>{noreply, <span style="color: #eedd82;">State</span>}.
<span style="color: #87cefa;">terminate</span>(<span style="color: #eedd82;">_Reason</span>, <span style="color: #eedd82;">_State</span>) -&gt;<span style="color: #87cefa;"> </span>ok.
<span style="color: #87cefa;">code_change</span>(<span style="color: #eedd82;">_OldVsn</span>, <span style="color: #eedd82;">State</span>, <span style="color: #eedd82;">_Extra</span>) -&gt;<span style="color: #87cefa;"> </span>{ok, <span style="color: #eedd82;">State</span>}.
</pre>
</div>

<ul class="org-ul">
<li>调用 gen_server:start_link(Name, CallBackMod, StartArgs, Opts) 来启动服务器：
<ul class="org-ul">
<li>第一个被调用的回调模块方法是 <span class="underline">Mod:init(StartArgs)</span> ,它必须返回 <span class="underline">{ok, State}</span></li>
<li>State 的值作为 <span class="underline">handle_call</span> 的 <span class="underline">第三个参数</span> 重新出现</li>
</ul></li>
<li>请注意是如何停止服务器的: handle_call(stop, From, Tab) 返回 {stop, normal, stopped, Tab} ,它会停止服务器
<ul class="org-ul">
<li>第二个参数 <span class="underline">normal</span> 被用作 <span class="underline">my_bank:terminate/2</span> 的 <span class="underline">首个参数</span></li>
<li>第三个参数 <span class="underline">stopped</span> 会成为 <span class="underline">my_bank:stop()</span> 的 <span class="underline">返回值</span></li>
</ul></li>
</ul>

<pre class="example">
     就是这样,我们的开发任务已经完成了
</pre>
</div>
</div>
