html/erlang/concurrency/otp.html

<div id="outline-container-orgc5d234b" class="outline-3">
<h3 id="orgc5d234b">测试</h3>
<div class="outline-text-3" id="text-orgc5d234b">
<p>
下面来访问一下银行：
</p>

<div class="org-src-container">
<pre class="src src-sh">6&gt; my_bank:start() <span style="color: #b0c4de;">.</span>              
{ok,&lt;0.46.0&gt;}

7&gt; my_bank:new_account(<span style="color: #ffa07a;">"joe"</span>) <span style="color: #b0c4de;">.</span>  
{welcome,<span style="color: #ffa07a;">"joe"</span>}

8&gt; my_bank:deposit(<span style="color: #ffa07a;">"joe"</span>, 10) <span style="color: #b0c4de;">.</span>   
{thanks,<span style="color: #ffa07a;">"joe"</span>,your_balance_is,10}

9&gt; my_bank:deposit(<span style="color: #ffa07a;">"joe"</span>, 30) <span style="color: #b0c4de;">.</span>    
{thanks,<span style="color: #ffa07a;">"joe"</span>,your_balance_is,40}

10&gt; my_bank:withdraw(<span style="color: #ffa07a;">"joe"</span>, 15) <span style="color: #b0c4de;">.</span>    
{thanks,<span style="color: #ffa07a;">"joe"</span>,your_balance_is,25}

11&gt; my_bank:withdraw(<span style="color: #ffa07a;">"joe"</span>, 45) <span style="color: #b0c4de;">.</span>    
{sorry,<span style="color: #ffa07a;">"joe"</span>,you_only_have,25,in_the_bank}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb83d8bb" class="outline-2">
<h2 id="orgb83d8bb">gen_server 的回调结构</h2>
<div class="outline-text-2" id="text-orgb83d8bb">
<p>
理解了相关概念之后,来详细了解一下 gen_server 的回调结构 
</p>
</div>

<div id="outline-container-org357bf5e" class="outline-3">
<h3 id="org357bf5e">启动服务器</h3>
<div class="outline-text-3" id="text-org357bf5e">
<p>
<span class="underline">gen_server:start_link(Name, Mod, InitArgs, Opts)</span> 这个调用是所有事物的起点：
</p>
<ul class="org-ul">
<li>它会创建一个名为 <span class="underline">Name</span> 的通用服务器</li>
<li>回调模块是 <span class="underline">Mod</span></li>
<li><span class="underline">Opts</span> 则控制通用服务器的行为：在这里可以指定 <span class="underline">消息记录</span> 、 <span class="underline">函数调试</span> 和 <span class="underline">其他行为</span></li>
<li>通用服务器通过调用 <span class="underline">Mod:init(InitArgs)</span> 启动</li>
</ul>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #ff4500;">%%</span><span style="color: #ff4500;">--------------------------------------------------------------------</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">@private</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">@doc</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">Initializes the server</span>
<span style="color: #ff4500;">%%</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">@spec init(Args) -&gt; {ok, State} |</span>
<span style="color: #ff4500;">%%                     </span><span style="color: #ff4500;">{ok, State, Timeout} |</span>
<span style="color: #ff4500;">%%                     </span><span style="color: #ff4500;">ignore |</span>
<span style="color: #ff4500;">%%                     </span><span style="color: #ff4500;">{stop, Reason}</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">@end</span>
<span style="color: #ff4500;">%%</span><span style="color: #ff4500;">--------------------------------------------------------------------</span>
<span style="color: #87cefa;">init</span>([]) -&gt;
    {ok, #<span style="color: #98fb98;">state</span>{}}.
</pre>
</div>

<p>
在通常的操作里,只会返回 <span class="underline">{ok, State}</span> ：如果返回 {ok, State} ,就说明 <b>成功启动</b> 了服务器,它的 <b>初始状态</b> 是 <span class="underline">State</span>
</p>

<pre class="example">
   要了解其他参数的含义,请参考 gen_server 的手册页
</pre>
</div>
</div>

<div id="outline-container-org32db777" class="outline-3">
<h3 id="org32db777">调用服务器</h3>
<div class="outline-text-3" id="text-org32db777">
<p>
要调用服务器,客户端程序需要执行 <span class="underline">gen_server:call(Name, Request)</span> 。它最终调用的是回调模块里的 <span class="underline">handle_call/3</span> : 
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #ff4500;">%%</span><span style="color: #ff4500;">--------------------------------------------------------------------</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">@private</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">@doc</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">Handling call messages</span>
<span style="color: #ff4500;">%%</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">@spec handle_call(Request, From, State) -&gt;</span>
<span style="color: #ff4500;">%%                                   </span><span style="color: #ff4500;">{reply, Reply, State} |</span>
<span style="color: #ff4500;">%%                                   </span><span style="color: #ff4500;">{reply, Reply, State, Timeout} |</span>
<span style="color: #ff4500;">%%                                   </span><span style="color: #ff4500;">{noreply, State} |</span>
<span style="color: #ff4500;">%%                                   </span><span style="color: #ff4500;">{noreply, State, Timeout} |</span>
<span style="color: #ff4500;">%%                                   </span><span style="color: #ff4500;">{stop, Reason, Reply, State} |</span>
<span style="color: #ff4500;">%%                                   </span><span style="color: #ff4500;">{stop, Reason, State}</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">@end</span>
<span style="color: #ff4500;">%%</span><span style="color: #ff4500;">--------------------------------------------------------------------</span>
<span style="color: #87cefa;">handle_call</span>(<span style="color: #eedd82;">_Request</span>, <span style="color: #eedd82;">_From</span>, <span style="color: #eedd82;">State</span>) -&gt;
    <span style="color: #eedd82;">Reply</span> = ok,
    {reply, <span style="color: #eedd82;">Reply</span>, <span style="color: #eedd82;">State</span>}.
</pre>
</div>

<p>
handle_call 函数：
</p>
<ul class="org-ul">
<li>参数：
<ul class="org-ul">
<li>_Request 其实是 gen_server:call/2 的第二个参数Request</li>
<li>_From 是发送请求的客户端进程的PID</li>
<li>_State 则是客户端的当前状态。</li>
</ul></li>
<li>返回值：
<ul class="org-ul">
<li>通常会返回 <span class="underline">{reply, Reply, NewState}</span> 
<ul class="org-ul">
<li>Reply 会返回客户端,成为 <span class="underline">gen_server:call</span> 的返回值</li>
<li>NewState 则是服务器接下来的状态。</li>
</ul></li>
<li>其他的返回值( <span class="underline">{noreply, ..}</span> 和 <span class="underline">{stop, ..}</span> )相对不太常用
<ul class="org-ul">
<li>no reply: 会让服务器继续工作,但客户端会等待一个回复,所以服务器必须把回复的任务委派给其他进程。用适当的参数调用</li>
<li>stop 会停止服务器</li>
</ul></li>
</ul></li>
</ul>
</div>

<div id="outline-container-org720dbfc" class="outline-4">
<h4 id="org720dbfc">播发</h4>
<div class="outline-text-4" id="text-org720dbfc">
<pre class="example">
    刚才已经见过了 gen_server:call 和 handle_call 之间的交互,它的作用是实现远程过程调用
</pre>
<p>
<span class="underline">gen_server:cast(Name, Msg)</span> 则实现了一个 <b>播发</b> (cast),也就是 <span class="underline">没有返回值的调用</span> 
</p>

<pre class="example">
      实际上就是一个消息转发,但习惯上称它为播发来与远程过程调用相区分
</pre>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #ff4500;">%%</span><span style="color: #ff4500;">--------------------------------------------------------------------</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">@private</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">@doc</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">Handling cast messages</span>
<span style="color: #ff4500;">%%</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">@spec handle_cast(Msg, State) -&gt; {noreply, State} |</span>
<span style="color: #ff4500;">%%                                  </span><span style="color: #ff4500;">{noreply, State, Timeout} |</span>
<span style="color: #ff4500;">%%                                  </span><span style="color: #ff4500;">{stop, Reason, State}</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">@end</span>
<span style="color: #ff4500;">%%</span><span style="color: #ff4500;">--------------------------------------------------------------------</span>
<span style="color: #87cefa;">handle_cast</span>(<span style="color: #eedd82;">_Msg</span>, <span style="color: #eedd82;">State</span>) -&gt;
    {noreply, <span style="color: #eedd82;">State</span>}.
</pre>
</div>

<p>
这个处理函数通常只返回 <span class="underline">{noreply, NewState}</span> 或 <span class="underline">{stop, &#x2026;}</span> ：
</p>
<ul class="org-ul">
<li>noreply： <b>改变</b> 服务器的状态</li>
<li>stop： <b>停止</b> 服务器</li>
</ul>
</div>
</div>

<div id="outline-container-orgfdddab7" class="outline-4">
<h4 id="orgfdddab7">发给服务器的自发性消息</h4>
<div class="outline-text-4" id="text-orgfdddab7">
<p>
回调函数 <span class="underline">handle_info(Info, State)</span> 被用来处理发给服务器的 <b>自发性消息</b> 。自发性消息是一切 <b>未经显式调用</b> <span class="underline">gen_server:call</span> 或 <span class="underline">gen_server:cast</span> 而到达服务器的消息
</p>

<pre class="example">
      举个例子,如果服务器连接到另一个进程并捕捉退出信号,就可能会突然收到一个预料之外的 {'EXIT', Pid,What} 消息

      除此之外,系统里任何知道通用服务器PID的进程都可以向它发送消息
</pre>

<p>
这样的消息在服务器里表现为 <span class="underline">info 值</span> ： 
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #ff4500;">%%</span><span style="color: #ff4500;">--------------------------------------------------------------------</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">@private</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">@doc</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">Handling all non call/cast messages</span>
<span style="color: #ff4500;">%%</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">@spec handle_info(Info, State) -&gt; {noreply, State} |</span>
<span style="color: #ff4500;">%%                                   </span><span style="color: #ff4500;">{noreply, State, Timeout} |</span>
<span style="color: #ff4500;">%%                                   </span><span style="color: #ff4500;">{stop, Reason, State}</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">@end</span>
<span style="color: #ff4500;">%%</span><span style="color: #ff4500;">--------------------------------------------------------------------</span>
<span style="color: #87cefa;">handle_info</span>(<span style="color: #eedd82;">_Info</span>, <span style="color: #eedd82;">State</span>) -&gt;
    {noreply, <span style="color: #eedd82;">State</span>}.
</pre>
</div>
</div>
</div>
</div>
