src/erlang/concurrency/otp.org
** 终止
   服务器会因为许多原因而终止：
   + 某个以 handle_ 开头的函数也许会返回一个 _{stop, Reason, NewState}_ 
   + 服务器也可能崩溃并生成 _{'EXIT', reason}_ 

   在所有这些情况下,无论它们是怎样发生的,都会调用 _terminate(Reason, NewState)_  。它的模板项如下：

   #+BEGIN_SRC erlang 
  %%--------------------------------------------------------------------
  %% @private
  %% @doc
  %% This function is called by a gen_server when it is about to
  %% terminate. It should be the opposite of Module:init/1 and do any
  %% necessary cleaning up. When it returns, the gen_server terminates
  %% with Reason. The return value is ignored.
  %%
  %% @spec terminate(Reason, State) -> void()
  %% @end
  %%--------------------------------------------------------------------
  terminate(_Reason, _State) ->
      ok.
   #+END_SRC
   这段代码不能返回一个新状态,因为已经终止了，但是了解服务器在终止时的状态非常有用：
   + 可以把状态保存到磁盘
   + 把它放入消息发送给别的进程
   + 根据应用程序的意愿丢弃它

   #+BEGIN_EXAMPLE
     如果想让服务器过后重启,就必须编写一个“我胡汉三又回来了”的函数,由 terminate/2 触发  
   #+END_EXAMPLE

** 代码更改
   可以在服务器运行时动态更改它的状态。这个 _回调函数_ 会在 _系统执行软件升级_ 时由 _版本处理子系统_ 调用：

   #+BEGIN_SRC erlang 
  %%--------------------------------------------------------------------
  %% @private
  %% @doc
  %% Convert process state when code is changed
  %%
  %% @spec code_change(OldVsn, State, Extra) -> {ok, NewState}
  %% @end
  %%--------------------------------------------------------------------
  code_change(_OldVsn, State, _Extra) ->
      {ok, State}.
   #+END_SRC

* 填写 gen_server 模板
  编写 OTP gen_server 大致上就是用你的代码填充一个预制模板,下面是一个例子。前一节分别列出了 gen_server 的各个区块，通过填充模板生成了一个名为 my_bank 的银行模块: 

  #+BEGIN_SRC erlang 
  -module(my_bank).

  -behaviour(gen_server).
  -export([start/0]).
  %% gen_server callbacks
  -export([init/1, handle_call/3, handle_cast/2, handle_info/2,
	   terminate/2, code_change/3]).
  -compile(export_all).
  -define(SERVER, ?MODULE). 

  start() -> gen_server:start_link({local, ?SERVER}, ?MODULE, [], []).
  stop()  -> gen_server:call(?MODULE, stop).

  new_account(Who)      -> gen_server:call(?MODULE, {new, Who}).
  deposit(Who, Amount)  -> gen_server:call(?MODULE, {add, Who, Amount}).
  withdraw(Who, Amount) -> gen_server:call(?MODULE, {remove, Who, Amount}).

  init([]) -> {ok, ets:new(?MODULE,[])}.

  handle_call({new,Who}, _From, Tab) ->
      Reply = case ets:lookup(Tab, Who) of
		  []  -> ets:insert(Tab, {Who,0}), 
			 {welcome, Who};
		  [_] -> {Who, you_already_are_a_customer}
	      end,
      {reply, Reply, Tab};

  handle_call({add,Who,X}, _From, Tab) ->
      Reply = case ets:lookup(Tab, Who) of
		  []  -> not_a_customer;
		  [{Who,Balance}] ->
		      NewBalance = Balance + X,
		      ets:insert(Tab, {Who, NewBalance}),
		      {thanks, Who, your_balance_is,  NewBalance}	
	      end,
      {reply, Reply, Tab};

  handle_call({remove,Who, X}, _From, Tab) ->
      Reply = case ets:lookup(Tab, Who) of
		  []  -> not_a_customer;
		  [{Who,Balance}] when X =< Balance ->
		      NewBalance = Balance - X,
		      ets:insert(Tab, {Who, NewBalance}),
		      {thanks, Who, your_balance_is,  NewBalance};	
		  [{Who,Balance}] ->
		      {sorry,Who,you_only_have,Balance,in_the_bank}
	      end,
      {reply, Reply, Tab};

  handle_call(stop, _From, Tab) ->
      {stop, normal, stopped, Tab}.
  handle_cast(_Msg, State) -> {noreply, State}.
  handle_info(_Info, State) -> {noreply, State}.
  terminate(_Reason, _State) -> ok.
  code_change(_OldVsn, State, _Extra) -> {ok, State}.
  #+END_SRC

  #+BEGIN_EXAMPLE
    这段代码取自模板，移除了模板里的所有注释,这样就能清楚地看到代码的结构
  #+END_EXAMPLE

