html/erlang/concurrency/otp.html

<div id="outline-container-orgff84f4d" class="outline-3">
<h3 id="orgff84f4d">终止</h3>
<div class="outline-text-3" id="text-orgff84f4d">
<p>
服务器会因为许多原因而终止：
</p>
<ul class="org-ul">
<li>某个以 handle_ 开头的函数也许会返回一个 <span class="underline">{stop, Reason, NewState}</span></li>
<li>服务器也可能崩溃并生成 <span class="underline">{'EXIT', reason}</span></li>
</ul>

<p>
在所有这些情况下,无论它们是怎样发生的,都会调用 <span class="underline">terminate(Reason, NewState)</span>  。它的模板项如下：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #ff4500;">%%</span><span style="color: #ff4500;">--------------------------------------------------------------------</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">@private</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">@doc</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">This function is called by a gen_server when it is about to</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">terminate. It should be the opposite of Module:init/1 and do any</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">necessary cleaning up. When it returns, the gen_server terminates</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">with Reason. The return value is ignored.</span>
<span style="color: #ff4500;">%%</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">@spec terminate(Reason, State) -&gt; void()</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">@end</span>
<span style="color: #ff4500;">%%</span><span style="color: #ff4500;">--------------------------------------------------------------------</span>
<span style="color: #87cefa;">terminate</span>(<span style="color: #eedd82;">_Reason</span>, <span style="color: #eedd82;">_State</span>) -&gt;
    ok.
</pre>
</div>
<p>
这段代码不能返回一个新状态,因为已经终止了，但是了解服务器在终止时的状态非常有用：
</p>
<ul class="org-ul">
<li>可以把状态保存到磁盘</li>
<li>把它放入消息发送给别的进程</li>
<li>根据应用程序的意愿丢弃它</li>
</ul>

<pre class="example">
     如果想让服务器过后重启,就必须编写一个“我胡汉三又回来了”的函数,由 terminate/2 触发  
</pre>
</div>
</div>

<div id="outline-container-org40deb59" class="outline-3">
<h3 id="org40deb59">代码更改</h3>
<div class="outline-text-3" id="text-org40deb59">
<p>
可以在服务器运行时动态更改它的状态。这个 <span class="underline">回调函数</span> 会在 <span class="underline">系统执行软件升级</span> 时由 <span class="underline">版本处理子系统</span> 调用：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #ff4500;">%%</span><span style="color: #ff4500;">--------------------------------------------------------------------</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">@private</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">@doc</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">Convert process state when code is changed</span>
<span style="color: #ff4500;">%%</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">@spec code_change(OldVsn, State, Extra) -&gt; {ok, NewState}</span>
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">@end</span>
<span style="color: #ff4500;">%%</span><span style="color: #ff4500;">--------------------------------------------------------------------</span>
<span style="color: #87cefa;">code_change</span>(<span style="color: #eedd82;">_OldVsn</span>, <span style="color: #eedd82;">State</span>, <span style="color: #eedd82;">_Extra</span>) -&gt;
    {ok, <span style="color: #eedd82;">State</span>}.
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org282cc56" class="outline-2">
<h2 id="org282cc56">填写 gen_server 模板</h2>
<div class="outline-text-2" id="text-org282cc56">
<p>
编写 OTP gen_server 大致上就是用你的代码填充一个预制模板,下面是一个例子。前一节分别列出了 gen_server 的各个区块，通过填充模板生成了一个名为 my_bank 的银行模块: 
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #7fffd4;">-module</span>(my_bank).

<span style="color: #7fffd4;">-behaviour</span>(gen_server).
<span style="color: #7fffd4;">-export</span>([<span style="color: #98fb98;">start/0</span>]).
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">gen_server callbacks</span>
<span style="color: #7fffd4;">-export</span>([<span style="color: #98fb98;">init/1</span>, <span style="color: #98fb98;">handle_call/3</span>, <span style="color: #98fb98;">handle_cast/2</span>, <span style="color: #98fb98;">handle_info/2</span>,
         <span style="color: #98fb98;">terminate/2</span>, <span style="color: #98fb98;">code_change/3</span>]).
<span style="color: #7fffd4;">-compile</span>(export_all).
<span style="color: #7fffd4;">-define</span>(<span style="color: #eedd82;">SERVER</span>, ?<span style="color: #7fffd4;">MODULE</span>). 

<span style="color: #87cefa;">start</span>() -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">gen_server</span>:<span style="color: #98fb98;">start_link</span>({local, ?<span style="color: #7fffd4;">SERVER</span>}, ?<span style="color: #7fffd4;">MODULE</span>, [], []).
<span style="color: #87cefa;">stop</span>()  -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">gen_server</span>:<span style="color: #98fb98;">call</span>(?<span style="color: #7fffd4;">MODULE</span>, stop).

<span style="color: #87cefa;">new_account</span>(<span style="color: #eedd82;">Who</span>)      -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">gen_server</span>:<span style="color: #98fb98;">call</span>(?<span style="color: #7fffd4;">MODULE</span>, {new, <span style="color: #eedd82;">Who</span>}).
<span style="color: #87cefa;">deposit</span>(<span style="color: #eedd82;">Who</span>, <span style="color: #eedd82;">Amount</span>)  -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">gen_server</span>:<span style="color: #98fb98;">call</span>(?<span style="color: #7fffd4;">MODULE</span>, {add, <span style="color: #eedd82;">Who</span>, <span style="color: #eedd82;">Amount</span>}).
<span style="color: #87cefa;">withdraw</span>(<span style="color: #eedd82;">Who</span>, <span style="color: #eedd82;">Amount</span>) -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">gen_server</span>:<span style="color: #98fb98;">call</span>(?<span style="color: #7fffd4;">MODULE</span>, {remove, <span style="color: #eedd82;">Who</span>, <span style="color: #eedd82;">Amount</span>}).

<span style="color: #87cefa;">init</span>([]) -&gt;<span style="color: #87cefa;"> </span>{ok, <span style="color: #98fb98;">ets</span>:<span style="color: #98fb98;">new</span>(?<span style="color: #7fffd4;">MODULE</span>,[])}.

<span style="color: #87cefa;">handle_call</span>({new,<span style="color: #eedd82;">Who</span>}, <span style="color: #eedd82;">_From</span>, <span style="color: #eedd82;">Tab</span>) -&gt;
    <span style="color: #eedd82;">Reply</span> = <span style="color: #00ffff;">case</span> <span style="color: #98fb98;">ets</span>:<span style="color: #98fb98;">lookup</span>(<span style="color: #eedd82;">Tab</span>, <span style="color: #eedd82;">Who</span>) <span style="color: #00ffff;">of</span>
                []  -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">ets</span>:<span style="color: #98fb98;">insert</span>(<span style="color: #eedd82;">Tab</span>, {<span style="color: #eedd82;">Who</span>,0}), 
                       {welcome, <span style="color: #eedd82;">Who</span>};
                [<span style="color: #eedd82;">_</span>] -&gt;<span style="color: #87cefa;"> </span>{<span style="color: #eedd82;">Who</span>, you_already_are_a_customer}
            <span style="color: #00ffff;">end</span>,
    {reply, <span style="color: #eedd82;">Reply</span>, <span style="color: #eedd82;">Tab</span>};

<span style="color: #87cefa;">handle_call</span>({add,<span style="color: #eedd82;">Who</span>,<span style="color: #eedd82;">X</span>}, <span style="color: #eedd82;">_From</span>, <span style="color: #eedd82;">Tab</span>) -&gt;
    <span style="color: #eedd82;">Reply</span> = <span style="color: #00ffff;">case</span> <span style="color: #98fb98;">ets</span>:<span style="color: #98fb98;">lookup</span>(<span style="color: #eedd82;">Tab</span>, <span style="color: #eedd82;">Who</span>) <span style="color: #00ffff;">of</span>
                []  -&gt;<span style="color: #87cefa;"> </span>not_a_customer;
                [{<span style="color: #eedd82;">Who</span>,<span style="color: #eedd82;">Balance</span>}] -&gt;
                    <span style="color: #eedd82;">NewBalance</span> = <span style="color: #eedd82;">Balance</span> + <span style="color: #eedd82;">X</span>,
                    <span style="color: #98fb98;">ets</span>:<span style="color: #98fb98;">insert</span>(<span style="color: #eedd82;">Tab</span>, {<span style="color: #eedd82;">Who</span>, <span style="color: #eedd82;">NewBalance</span>}),
                    {thanks, <span style="color: #eedd82;">Who</span>, your_balance_is,  <span style="color: #eedd82;">NewBalance</span>} 
            <span style="color: #00ffff;">end</span>,
    {reply, <span style="color: #eedd82;">Reply</span>, <span style="color: #eedd82;">Tab</span>};

<span style="color: #87cefa;">handle_call</span>({remove,<span style="color: #eedd82;">Who</span>, <span style="color: #eedd82;">X</span>}, <span style="color: #eedd82;">_From</span>, <span style="color: #eedd82;">Tab</span>) -&gt;
    <span style="color: #eedd82;">Reply</span> = <span style="color: #00ffff;">case</span> <span style="color: #98fb98;">ets</span>:<span style="color: #98fb98;">lookup</span>(<span style="color: #eedd82;">Tab</span>, <span style="color: #eedd82;">Who</span>) <span style="color: #00ffff;">of</span>
                []  -&gt;<span style="color: #87cefa;"> </span>not_a_customer;
                [{<span style="color: #eedd82;">Who</span>,<span style="color: #eedd82;">Balance</span>}] <span style="color: #00ffff;">when</span> <span style="color: #eedd82;">X</span> =&lt; <span style="color: #eedd82;">Balance</span> -&gt;
                    <span style="color: #eedd82;">NewBalance</span> = <span style="color: #eedd82;">Balance</span> - <span style="color: #eedd82;">X</span>,
                    <span style="color: #98fb98;">ets</span>:<span style="color: #98fb98;">insert</span>(<span style="color: #eedd82;">Tab</span>, {<span style="color: #eedd82;">Who</span>, <span style="color: #eedd82;">NewBalance</span>}),
                    {thanks, <span style="color: #eedd82;">Who</span>, your_balance_is,  <span style="color: #eedd82;">NewBalance</span>};        
                [{<span style="color: #eedd82;">Who</span>,<span style="color: #eedd82;">Balance</span>}] -&gt;
                    {sorry,<span style="color: #eedd82;">Who</span>,you_only_have,<span style="color: #eedd82;">Balance</span>,in_the_bank}
            <span style="color: #00ffff;">end</span>,
    {reply, <span style="color: #eedd82;">Reply</span>, <span style="color: #eedd82;">Tab</span>};

<span style="color: #87cefa;">handle_call</span>(stop, <span style="color: #eedd82;">_From</span>, <span style="color: #eedd82;">Tab</span>) -&gt;
    {stop, normal, stopped, <span style="color: #eedd82;">Tab</span>}.
<span style="color: #87cefa;">handle_cast</span>(<span style="color: #eedd82;">_Msg</span>, <span style="color: #eedd82;">State</span>) -&gt;<span style="color: #87cefa;"> </span>{noreply, <span style="color: #eedd82;">State</span>}.
<span style="color: #87cefa;">handle_info</span>(<span style="color: #eedd82;">_Info</span>, <span style="color: #eedd82;">State</span>) -&gt;<span style="color: #87cefa;"> </span>{noreply, <span style="color: #eedd82;">State</span>}.
<span style="color: #87cefa;">terminate</span>(<span style="color: #eedd82;">_Reason</span>, <span style="color: #eedd82;">_State</span>) -&gt;<span style="color: #87cefa;"> </span>ok.
<span style="color: #87cefa;">code_change</span>(<span style="color: #eedd82;">_OldVsn</span>, <span style="color: #eedd82;">State</span>, <span style="color: #eedd82;">_Extra</span>) -&gt;<span style="color: #87cefa;"> </span>{ok, <span style="color: #eedd82;">State</span>}.
</pre>
</div>

<pre class="example">
    这段代码取自模板，移除了模板里的所有注释,这样就能清楚地看到代码的结构
</pre>
</div>
</div>
